name = '"СВЕТ ДАЛЕКИХ ПЛАНЕТ"'


planet = '''
.    .    *  .   .  .   .  *     .  .        . .   .     .  *   .     .  .   .
   *  .    .    *  .     .         .    * .     .  *  .    .   .   *   . .    .
. *      .   .    .  .     .  *      .      .        .     .-o--.   .    *  .
 .  .        .     .     .      .    .     *      *   .   :O o O :      .     .
____   *   .    .      .   .           .  .   .      .    : O. Oo;    .   .
 `. ````.---...___      .      *    .      .       .   * . `-.O-'  .     * . .
   \_    ;   \`.-'```--..__.       .    .      * .     .       .     .        .
   ,'_,-' _,-'             ``--._    .   *   .   .  .       .   *   .     .  .
   -'  ,-'                       `-._ *     .       .   *  .           .    .
    ,-'            _,-._            ,`-. .    .   .     .      .     *    .   .
    '--.     _ _.._`-.  `-._        |   `_   .      *  .    .   .     .  .    .
        ;  ,' ' _  `._`._   `.      `,-''  `-.     .    .     .    .      .  .
     ,-'   \    `;.   `. ;`   `._  _/\___     `.       .    *     .    . *
     \      \ ,  `-'    )        `':_  ; \      `. . *     .        .    .    *
      \    _; `       ,;               __;        `. .           .   .     . .
'''
ufo = '''
.     .       .  .   . .   .   . .    +  .
  .     .  :     .    .. :. .___---------___.
       .  .   .    .  :.:. _".^ .^ ^.  '.. :"-_. .
    .  :       .  .  .:../:            . .^  :.:\.
        .   . :: +. :.:/: .   .    .        . . .:\
 .  :    .     . _ :::/:               .  ^ .  . .:\
  .. . .   . - : :.:./.                        .  .:\
  .      .     . :..|:                    .  .  ^. .:|
    .       . : : ..||        .                . . !:|
  .     . . . ::. ::\(                           . :)/
 .   .     : . : .:.|. ######              .#######::|
  :.. .  :-  : .:  ::|.#######           ..########:|
 .  .  .  ..  .  .. :\ ########          :######## :/
  .        .+ :: : -.:\ ########       . ########.:/
    .  .+   . . . . :.:\. #######       #######..:/
      :: . . . . ::.:..:.\           .   .   ..:/
   .   .   .  .. :  -::::.\.       | |     . .:/
      .  :  .  .  .-:.":.::.\             ..:/
 .      -.   . . . .: .:::.:.\.           .:/
.   .   .  :      : ....::_:..:\   ___.  :/
   .   .  .   .:. .. .  .: :.:.:\       :/
     +   .   .   : . ::. :.:. .:.|\  .:/|
     .         +   .  .  ...:: ..|  --.:|
.      . . .   .  .  . ... :..:.."(  ..)"
 .   .       .      :  .   .: ::/  .  .::\ '''


spider = '''
________/
_______/\
______/\ \
_____/\ \ \
____/\ \ \ \
___/\ \ \ \ \
__/\ \ \ \ \ \
_/\ \ \ \ \ \ \
/\ \ \ \ \ \ \ \
\/-/-/-/-/-/-/-/-----------------------------------.--------
_\/ / / / / / /                                    |
__\/ / / / / /                                   \(|)/
___\/ / / / /                                   --(")--
____\/ / / /                                      /`\   '''




game_over = '''/^(o.o)^\ /^(o.o)^\ /^(o.o)^\ /^(o.o)^\ /^(o.o)^\ /^(o.o)^\
'''

cat = '''=^..^=   =^..^=   =^..^=    =^..^=    =^..^=    =^..^=    =^..^=
'''


part_1 = f'''{planet}
ЧАСТЬ 1. ДОБРАТЬСЯ ДОМОЙ

    Небо изменило цвет, стало ярким, сине-фиолетовым, 
с огромными спиральными галактиками, звёздными скоплениями, 
и одна из галактик превратилась в звездный корабль. 
Медленно приближаясь, он спустился к поверхности. 
НЛО было гигантских размеров, почти от горизонта до горизонта. 
Все люди перепугались,военные оцепили дороги, ввели пропускной режим.
 - Кто они, что им надо, слышалось повсюду.
А мне нужно отвести младшую сестру родителям.

1. Остаться дома.
2. Выйти днем, пока на улице беспорядки и толпы народа.
3. Выйти вечером. Темнота и много военных.
(введи число с клавиатуры и нажми 'enter')'''
# choice_1 = int(input('Что выберешь: '))

# 1.1  Остаться дома. 
result_1_1 = f'''

Наступил вечер. Тьма сгустилась. Люди попрятались по домам. 
По улицам, почти бесшумно скользили машины. Последние лучи солнца 
скрылись за горизонтом и на город опустилась пронзительная темнота. 
Корабль не издавал ни звука, его корпус был похож на перевернутого монстра 
высеченного из камня. Что-то произошло с электричеством. 
Сотовая связь и интернет пропали. Часть города погрузилась во мрак, 
уличные фонари погасли. Еще вчера люди сидели в кафе, наслаждаясь кофе 
и свежим летним воздухом, катались на велосипедах по набережной, 
купались в реке и смеялись. Сегодня днем я слышала стрельбу и крики людей. 
Мы жили на одной из главных улиц. Машины военных периодически вспарывали 
фарами ночную темноту. Мы разговаривали шепотом. Наверное, шепот стал 
одним из главных проявлений произошедших изменений. Днем шепот перекатывался 
и накрывал улицы и дома, к вечеру он стих, но если прислушаться, 
тихое гудение людских голосов не прекращалось. Телевидение и радио молчало. 
Город словно вымер, но военных машин и людей в форме становилось все больше.
Сестра уснула в четвертом часу. Сколько еще продлиться это безумие?

***   ВЫ НЕ ПРОСНУЛИСЬ   ***
{game_over}
***   ИГРА ЗАКОНЧЕНА   ***
{ufo}'''

# 1.2  Выйти днем, пока на улице беспорядки и толпы народа.
result_1_2 = '''

Сборы не заняли много времени. Удобная одежда и обувь, 
телефон, ключи. Пожалуйста, пусть родные будут дома. Еще раз пытаюсь позвонить, 
тишина. Идет вызов, но телефонная трубка не издает ни звука. Пешком идти часа полтора. 
Мы выходим из подъезда, стараясь держаться в тени, поближе к зданиям, люди бегут,
словно испуганные тараканы, в разные стороны, иногда замирают задирая головы в небо. 
Где-то на краю города в небо взметнулся столб дыма. 
Цепляясь к группе людей, спешащих в нужную сторону, мы благополучно минуем очередной,
еще не развернутый блокпост. Где-то за нашей спиной уже полностью перекрыта дорога, 
люди начинают кричать, чтобы их пропустили. Ускоряю шаг. Осталось еще несколько кварталов, 
уже приближаемся к дому. 
Сестра дергает за руку, - можно свернуть с основной дороги во двор, пройти напрямик, говорит она.
Мне страшно, хоть я и стараюсь не подавать вида. Хорошо, что она такая смелая.

1. Пройти напрямик.
2. Идти по основной дороге.'''
# choice_1_2 = int(input('Что выберешь? '))

# 1.2.1. Подъезд
result_1_2_1 = '''

Странное ощущение. Как будто за тобой крадется твоя собственная тень. 
Оборачиваюсь. Сумрак, тишина, брошенные машины, открытые окна домов, 
протяжный скрип качелей на детской площадке. Не по себе, как будто люди покинули город. 
Крепче сжимаю ее руку. Нет, не ощущение. Заходим в ближайший подъезд. 
Двери квартир открыты, вещи разбросаны. Заходим в квартиру, закрываю дверь на замок. 
Снаружи хлопает дверь подъезда, слышу тяжелые шаги. 
Сестра обнимает меня, и утыкается лицом в грудь. 
Задерживаю дыхание и еле сдерживаю крик, от резкого удара в дверь. 
Еще удар, ругань, и незнакомец уходит на верхние этажи. 
В квартире разлита странная, едко пахнущая жидкость. Сложно дышать. 
Прислушиваюсь. Еще несколько минут и мы попробуем добежать до дома. 
А если он затаился и ждет? На окнах решетки, выход только один.

1. Затаиться и ждать.
2. Снять обувь, открыть дверь и убежать.'''
# choice_1_2_1 = ('Как поступишь? ')

# 1.2.1.1.  Затаиться и ждать 
result_1_2_1_1 = f'''

Проходит около получаса. Снова эти шаги. 
Он останавливается на площадке. В дверь ударяется что-то очень тяжелое, 
сыпется побелка. Мы бежим в спальню, слышу как вылетает выбитая дверь 
и падает на пол. Залезаем под кровать. Сердце бьется словно бешеное. 
Огромные сапоги проносятся по дому выкидывают вещи из шкафов, 
добавляя в окружающий хаос еще больше беспорядка. 
Останавливается, замечает следы на полу. 
Я наступила в ту мерзкую лужу, пока бежала. 
***   ВЫ ЗАДЕРЖАЛИ ЕГО И ПОГИБЛИ, НО СЕСТРЕ УДАЛОСЬ УБЕЖАТЬ   ***
{game_over}
***   ИГРА ЗАКОНЧЕНА   ***
{spider}'''

# 1.2.1.2. Снять обувь, открыть дверь и убежать
result_1_2_1_2 = '''

Только пробежав несколько домов, мы останавливаемся, 
чтобы обуться. Снова на улице появляются люди. Мы подходим к нашему дому. 
Лифт не работает, идем по лестнице. Получилось. Обнимаемся. Слезы. 
Мне нужно вернуться, говорю я. Там программа. 
Она сможет помочь понять что происходит. 
Хорошо, говорит отец, мой брат, сможет тебя отвезти. 
Он врач, его недавно призвали в службу экстренной помощи. 
Медикам и военным еще разрешают передвигаться по городу, если есть документы.'''

# 1.2.2. Идти по основной дороге.
result_1_2_2 = '''

Странное ощущение. Как будто за тобой крадется твоя собственная тень. 
Оборачиваюсь. Сумрак, тишина, брошенные машины, открытые окна домов, 
протяжный скрип качелей на детской площадке.
 Не по себе, как будто люди покинули город. Крепче сжимаю ее руку. 
Пройдя еще немного мы подходим к нашему дому. Лифт не работает, идем по лестнице. 
Получилось. Обнимаемся. Слезы. Мне нужно вернуться, говорю я. Там программа. 
Она сможет помочь понять что происходит. Хорошо, говорит отец, 
мой брат сможет тебя отвезти. Он врач, его недавно призвали в службу экстренной помощи. 
Медикам и военным еще разрешают передвигаться по городу, если есть документы.'''


# 1.3. Выйти вечером. Темнота и много военных.
# 1.2 и 1.2.1 и 1.2.1.1 и 1.2.1.2

part_2 = '''

    ЧАСТЬ 2. ПРОГРАММА МОДЕЛИРОВАНИЯ БУДУЩЕГО

    Меня довезли до дома только вечером следующего дня. 
Город словно сошел с ума, сказал брат отца, вкатываясь в комнату, 
и плюхаясь на диван. Ты не представляешь, что там происходит. 
Затаив дыхание слушаю его. Он вздыхает, - по городу орудуют шайки мародеров, 
говорит он, люди, вот кто причина всех несчастий. 
А тарелка, спрашивает отец, про нее что-нибудь слышно? 
- Нет, все что нам сказали - это не задавать лишних вопросов. 
И не включайте ночью свет, попросил он уходя. 
Кого? - спросили мы хором. Он не ответил, а взял меня за руку, вздохнул, и мы вышли.

    Дом. Вот я и вернулась. Дом остался целым и невредимым, как и весь наш квартал. 
Военные сохранили хоть какой-то порядок. 
Ночью мы сидели в комнате и пили чай, было темно, я на компе 
поставила процесс моделирования будущего, посмотреть к чему все приведет, 
выключила монитор, чтобы не был заметен свет. 
Брат отца вышел, спрятался, я осталась одна чтобы посмотреть результат моделирования. 
Снаружи стоял инопланетянин или человек в белом защитном костюме, выше обычного человека а полтора раза. 
И ещё, военный в черном костюме. На белом человеке был шлем, с черным непроницаемым защитным стеклом. 
Я включила экран. Он просто взлетел и прошел через стену в комнату. Я почувствовала его у себя за спиной.
- Пойдем, сказал он, залезай и держись крепче.
Я залезла к нему на спину, он обхватил мои ноги своими руками, я обняла его за грудь. 
Белые щитки его защитного костюма были теплые твердые и гладкие. Мы подлетели к стене. 
Сейчас что-то произойдет, подумала я, ведь я не умею просачиваться сквозь стены. 
Он заметил мое волнение, или прочитал мысли.
- Расслабься, сказал он, с первым молекулярным перемещением. 
Мы растворились на частицы, и, потом, с высоты, рухнули вниз.
Это ощущение похоже на то, когда пол внезапно уходит из под ног, и ты уже летишь.
Проснулась. 
Интересный сон, подумала я.

    Ночь. Я в своей комнате, никого рядом нет. Думаю снова про них. 
Но у меня нет страха перед неизвестным. Ведь никто не знает, зачем они прилетели, 
зачем им нужны люди, что они с ними делают, когда забирают. 
И еще никто не возвращался и не рассказывал.
Я включаю компьютер, загружаю программу моделирования будущего. 
Белый и черный человек, как во сне, приезжают, и останавливаются под окнами. 
Они как будто чувствуют, и не хотят, чтобы программа успела выполнить свою задачу.

    
    
Я включаю экран. Зелёная полоска скромно мигает на 70%. Спиной ощущаю, как он влетает в комнату.

Поворачиваюсь к нему. Семьдесят процентов, не упела, жаль. 
Белый костюм в темноте выделяется светлым пятном. Лицо скрыто за черным матовым стеклом.

1. Позвать брата.
2. Сделать шаг навстречу.
3. Убежать.'''
# choice_2 = ('Что сделаешь? ')

# ВТОРОЙ ВЫБОР
# 2.1.  Позвать брата
result_2_1 = '''

Судорожно пытаюсь вскрикнуть, пятясь назад, кричу изо всех сил, но нет звука. 
Тишина. Он делает шаг вперед, все словно в замедленной съемке, воздух плотный, словно кисель. 
Он подходит, поворачивает меня спиной к себе обхватывает поверх моих рук. 
Тише, ты так всех разбудишь. Я пытаюсь вырваться, но руки, крепко сжимающие меня намного сильнее. 
Закрой глаза. Почему-то хочется ему довериться, и пусть будет, что будет. 
Сейчас нет никакого смысла воевать. Силы не равны. Вспоминая своего тренера по боксу, 
который говорил, царапайся из последних сил. Царапайся! 
Пытаюсь вывернуться из железной хватки. Еще больше сжимает меня, встряхивает. 
Мне становится трудно дышать, больно. 
Закрой глаза, снова без эмоций приказывает он. Закрываю. Слабость. 
Успеваю почувствовать как ноги подкашиваются, а он ловит меня и берет на руки.'''
 
# 2.2. Сделать шаг навстречу
result_2_2 = '''

Хорошая девочка, чувствую, как он улыбается сквозь непроницаемый мрак защитного стекла.
- Запрыгивай, говорит он.
Точно также, как и во сне мы проходим сквозь стену и ныряем вниз. 
Свободное падение, его не с чем не спутаешь. 
Белый мотоцикл ждет под окном. Человека в черном уже нет. 
- Закрой глаза. 
В его голосе нет эмоций. Ни радости, ни печали, как будто он знает, 
что у меня нет выбора и я подчинюсь в любом случае.
 Он подходит ко мне и закрывает мне глаза своей рукой. 
 Слабость. Успеваю почувствовать как ноги подкашиваются, а он ловит меня.'''

# 2.3.   Убежать
result_2_3 = '''

Судорожно пытаюсь вскрикнуть, пятясь назад, 
кричу изо всех сил, но нет звука. Тишина. Он делает шаг вперед, 
все словно в замедленной съемке, воздух плотный, словно кисель. 
Он подходит, поворачивает меня спиной к себе обхватывает поверх моих рук. 
Тише, ты так всех разбудишь. Я пытаюсь вырваться, но руки, крепко сжимающие меня намного сильнее. 
- Закрой глаза. 
Почему-то хочется ему довериться, и пусть будет, что будет. 
Сейчас нет никакого смысла воевать. Силы не равны. Вспоминая своего тренера по боксу, 
который говорил, царапайся из последних сил. Царапайся. 
Пытаюсь вывернуться из железной хватки. Еще больше сжимает меня, встряхивает. 
Мне становится трудно дышать, больно. 
Закрой глаза, снова без эмоций приказывает он. Закрываю. Слабость. 
Успеваю почувствовать как ноги подкашиваются, а он ловит меня и берет на руки.'''

part_3 = '''

    ЧАСТЬ 3. КОРАБЛЬ И ТАЙНА ПРЕВРАЩЕНИЙ

    Открываю глаза. Я уже на корабле, он оставляет меня на гранитном столбе метр на метр. 
Вокруг гранитные уступы правильной геометрической формы уходят в темноту. 
Пространство вокруг начинает вибрировать. 
Чувствую,как я становлюсь выше и что-то во мне меняется. 
Снова слабость, сворачиваюсь на камне. Через минуту на мне уже такой же 
белый защитный костюм и шлем с темным непроницаемым стеклом. 
Камень плавно скользит вниз. Серые стены остаются высоко над головой. 
Спускаюсь к земле на каменной платформе. Город, утопленный в темноте, 
с высоты кажется таким маленьким и беззащитным. Проходит еще немного времени, 
и я оказываюсь на поверхности, на тех улицах, которые я знаю.

Какой-то корабль поменьше, улетает в небо, превращаясь сначала в яркую точку, 
и затем полностью исчезая в небе.

Вокруг меня появляются платформы. Квадраты разных цветов. Такие привлекательные. 
Стекло шлема их подсвечивает, создавая эффект объемного изображения.

1. Разбежаться и прыгнуть на платформу.
2. Сесть и ждать .
3. Кинуть какой-нибудь предмет на платформу.'''
# choice_3 = ('Что сделаешь? ')

# ТРЕТИЙ ВЫБОР
# 3.1. Разбежаться и прыгнуть на платформу
result_3_1 = '''

    Я разбегаюсь и прыгаю на одну из платформ. 
Она подбрасывает меня далеко в воздух, здесь страшно немного, вдруг разобьюсь, 
но ничего не случается, приземляюсь, нормально, рядом с другой такой же платформой. 
Крутой способ передвижения, думаю я.

Вижу рядом столб темного света. Захожу в него. 
Прилетает задача: “спасти беженцев”. 
Какая-то шайка молодых парней пытаются ограбить людей, угрожая пистолетом. 
Немного растерявшись от моего внезапного появления шайка замирает, 
я забираю из рук пистолет, нажимаю курок не целясь ни в кого конкретно, чтобы испугать. 
Пистолет молчит.

1. Взвести курок.
2. Еще раз нажать на курок.
3. Кинуть какой-нибудь предмет на платформу.'''

# 3.2. Сесть и ждать 
result_3_2 = '''

    Город словно вымер. Тишина и полное безмолвие. Не меняется ничего. 
Через несколько часов я не выдерживаю, разбегаюсь, и прыгаю на одну из платформ. 
Она подбрасывает меня далеко в воздух, здесь страшно немного, вдруг разобьюсь, 
но ничего не случается, приземляюсь, нормально, рядом с другой такой же платформой. 
Крутой способ передвижения, думаю я.

    Вижу рядом столб темного света. Захожу в него. 
Прилетает задача: “спасти беженцев”. 
Какая-то шайка молодых парней пытаются ограбить людей, угрожая пистолетом. 
Немного растерявшись от моего внезапного появления шайка замирает, 
я забираю из рук пистолет, нажимаю курок не целясь ни в кого конкретно, чтобы испугать. 
Пистолет молчит.

1. Взвести курок.
2. Еще раз нажать на курок.
3. Кинуть какой-нибудь предмет на платформу.'''

# 3.3. Кинуть какой-нибудь предмет на платформу
result_3_3 = '''

    Мир изменился, я изменилась. Попробовала снять шлем, не получилось. 
Снимать костюм можно даже не пробовать. Чувствую его на себе, словно вторую кожу. 
И честно сказать, чертовски приятное ощущение, не холодно, не жарко, удобно. 
Подбираю камень, кидаю на платформу. Он спокойно отскакивает от нее, 
как от деревяшки и скатывается на землю. Трогаю ее рукой. Ничего. 
Я разбегаюсь и прыгаю на платформу. Она подбрасывает меня высоко и далеко в воздух. 
Здесь страшно немного, вдруг разобьюсь, но ничего не случается. 
Приземляюсь нормально, рядом с другой такой же платформой. 
Крутой способ передвижения, думаю я.

    Вижу рядом столб темного света. Захожу в него. 
Прилетает задача: “спасти беженцев”. 
Какая-то шайка молодых парней пытаются ограбить людей, угрожая пистолетом. 
Немного растерявшись от моего внезапного появления шайка замирает, 
я забираю из рук пистолет, нажимаю курок не целясь ни в кого конкретно, чтобы испугать. 
Пистолет молчит.

1. Взвести курок.
2. Еще раз нажать на курок.
3. Кинуть какой-нибудь предмет на платформу.'''
# choice_4 = ('Что будешь делать? ')

# ЧЕТВЕРТЫЙ ВЫБОР
# 4.1. Взвести курок
result_4_1 = f'''

    Учитывая, что вижу револьвер в первый раз, вспоминаю, 
что нужно взвести курок. Взвожу, стреляю, наконец-то шайка понимает, 
что сражаться без оружия с человеком в белой защите не очень умная идея. 
Они бросаются врассыпную, а беженцы, медленно пятясь и вздыхая с облегчением покидают место сражения.
Значок, "задание выполнено, уровень новичок", мигает где-то в левом углу стекла шлема. 
Мне ещё учиться и учиться, думаю я.
    
    Впереди много интересного.

***   ВЫ ПОБЕДИЛИ!   ***
{cat}'''

# 4.2. Еще раз нажать на курок
result_4_2 = f'''

    Снова нажимаю на курок. Раздается выстрел. Наконец-то шайка понимает, 
что сражаться без оружия с человеком в белой защите не очень умная идея. 
Они бросаются врассыпную, а беженцы,медленно пятясь и вздыхая с облегчением 
покидают место сражения.
Значок, "задание выполнено, уровень новичок", мигает где-то в левом углу стекла шлема. 
Мне ещё учиться и учиться, думаю я.
    
    Впереди много интересного.

***   ВЫ ПОБЕДИЛИ!   ***
{cat}'''

# 4.3. Ударить ближайшего мародера.
result_4_3 = f'''

    Уроки по боксу не прошли даром, с правой у меня всегда отлично 
получалось бить. Удар в голову, затем локтем, крики, стоны. 
Соперник просто упал на асфальт, а его группа поддержки бросились врассыпную. 
Наконец-то шайка поняла, что сражаться без оружия с человеком в белой защите 
не очень умная идея. Они бросаются врассыпную, а беженцы, медленно пятясь 
и вздыхая с облегчением покидают место сражения.
Значок, "задание выполнено, уровень новичок", мигает где-то в левом углу стекла шлема. 
Мне ещё учиться и учиться, думаю я.
    
    Впереди много интересного.

***   ВЫ ПОБЕДИЛИ!   ***
{cat}'''




print(name)
print(part_1)

choice_1 = int(input('Что будешь делать? '))
if choice_1 == 1:
    print(result_1_1)
    
elif choice_1 == 2 or choice_1 == 3:
    print(result_1_2)
    choice_1_2 = int(input('Что выберешь? '))
    if choice_1_2 == 1:
        print(result_1_2_1)
        choice_1_2_1 = int(input('Как поступишь? '))
        if choice_1_2_1 == 1:
            print(result_1_2_1_1)                          # GG
            
        elif choice_1_2_1 == 2:
            print(result_1_2_1_2)                          # Переход куда?
            # print(part_2)
    elif choice_1_2 == 2:
        print(result_1_2_2)
        # print(part_2)
print(part_2)
choice_2 = int(input('Что сделаешь? '))
if choice_2 == 1:
    print(result_2_1)
elif choice_2 == 2:
    print(result_2_2)
elif choice_2 == 3:
    print(result_2_3)
print(part_3)
choice_3 = int(input('Что сделаешь? '))
if choice_3 == 1:
    print(result_3_1)
elif choice_3 == 2:
    print(result_3_2)
elif choice_3 == 3:
    print(result_3_3)
choice_4 = int(input('Что будешь делать? '))
if choice_4 == 1:
    print(result_4_1)
elif choice_4 == 2:
    print(result_4_2)
elif choice_4 == 3:
    print(result_4_3)




# 1.3. Выйти вечером. Темнота и много военных.
# 1.2 и 1.2.1 и 1.2.1.1 и 1.2.1.2




